---
kind: property
id: P:Autodesk.Revit.DB.Electrical.PanelScheduleSheetInstance.ScheduleId
source: html/ac8663cf-52bf-f4f4-b457-4f1b443f6840.htm
---
# Autodesk.Revit.DB.Electrical.PanelScheduleSheetInstance.ScheduleId Property

The panel schedule id.

## Syntax (C#)
```csharp
public ElementId ScheduleId { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null